In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [10, 20, 30, 40],
    'C': [100, 200, 300, 400]
})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

# applying functions across the data

In [4]:
# apply applies a function on column or row

df['C'].apply(np.sqrt)

0    10.000000
1    14.142136
2    17.320508
3    20.000000
Name: C, dtype: float64

In [5]:
# multiply by 3

def multiply_by_three(n):
    return n*3

In [6]:
df['A'].apply(multiply_by_three)

0     3
1     6
2     9
3    12
Name: A, dtype: int64

In [8]:
df[['A', 'B']].apply(multiply_by_three)

    A    B
0   3   30
1   6   60
2   9   90
3  12  120

In [9]:
# map

mapping = {1: 'ONE', 2: 'TWO' , 3: 'THREE' , 4: 'FOUR'}
df['A'].map(mapping)

0      ONE
1      TWO
2    THREE
3     FOUR
Name: A, dtype: object

In [10]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [11]:
df.applymap(multiply_by_three)

    A    B     C
0   3   30   300
1   6   60   600
2   9   90   900
3  12  120  1200

# groupby

In [13]:
df2 = pd.DataFrame({
    'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    'Max Speed': [380., 370., 24., 26.],
    'Weight': [1, 1.5, 0.3, 0.5]
})
df2

   Animal  Max Speed  Weight
0  Falcon      380.0     1.0
1  Falcon      370.0     1.5
2  Parrot       24.0     0.3
3  Parrot       26.0     0.5

In [15]:
df2.groupby('Animal').mean()

        Max Speed  Weight
Animal
Falcon      375.0    1.25
Parrot       25.0    0.40